// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

/* Console.Write("Input first number: ");
int number_1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input second number: ");
int number_2 = Convert.ToInt32(Console.ReadLine());

if (number_1 > number_2)
{
    Console.WriteLine("a = " + number_1 + ", b = " + number_2 + " -> " + " max " + number_1);

}
else
{
    Console.WriteLine("a = " + number_1 + ", b = " + number_2 + " -> " + " max " + number_2);

} */

// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

/* Console.Write("Input first number: ");
int number_1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input second number: ");
int number_2 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input second number: ");
int number_3 = Convert.ToInt32(Console.ReadLine());

if (number_1 > number_2 && number_1 > number_3)
{
    Console.WriteLine(number_1 + ", " + number_2 + ", " + number_3 + " -> " + number_1);
}
if (number_2 > number_3)
{
    Console.WriteLine(number_1 + ", " + number_2 + ", " + number_3 + " -> " + number_2);
}
else
{
    Console.WriteLine(number_1 + ", " + number_2 + ", " + number_3 + " -> " + number_3);
}


*/
// первые две задачи выше

// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

/* Console.Write("Input first number: ");
int number_1 = Convert.ToInt32(Console.ReadLine());

if (number_1 % 2 == 0)
{
    Console.WriteLine(number_1 + " -> " + "yes");
}
else
{
    Console.WriteLine(number_1 + " -> " + "no");
} */